#4.1
def task1():
    пароль = input ("Введите пароль - ")
    повт = input ("Введите пароль повторно - ")
    if пароль == повт:
        print ("Пароль принят")
    else:
        print ("Пароль не принят")


#4.2
def task2():
    a = int(input ("Введите номер места - "))
    if a % 2 == 0:
        if 37 <= a <= 54:
            print ("Верхнее боковое")
        elif a < 37:
            print ("Верхнее в купе")
        else:
            print ("Такого места в вагоне нет")
    else:
        if 37 <= a <= 54:
            print("Нижнее боковое")
        elif a < 37:
            print("Нижнее в купе")
        else:
            print("Такого места в вагоне нет")


#4.3
def task3():
    b = int(input ("Введите год - "))

    if b % 400 == 0:
        print("Год", b, "високосный")
    elif b % 4 == 0:
        if b % 100 != 0:
            print("Год", b, "високосный")
        else:
            print("Год", b, "не високосный")
    else:
        print("Год", b, "не високосный")

#4.4
def task4():
    c = input ("Введите первый цвет - ")
    d = input ("Введите второй цвет - ")
    if (c == "Красный" and d == "Синий") or (c == "Синий" and d == "Красный") or (c == "синий" and d == "красный") or (c == "красный" and d == "синий"):
        print ("Фиолетовый")
    elif (c == "Красный" and d == "Желтый") or (c == "Желтый" and d == "Красный") or (c == "желтый" and d == "красный") or (c == "красный" and d == "желтый"):
        print("Оранжевый")
    elif (c == "Синий" and d == "Желтый") or (c == "Желтый" and d == "Синий") or (c == "желтый" and d == "синий") or (c == "синий" and d == "желтый"):
        print("Зеленый")
    else:
        print ("Ошибка, попробуйте заново")


a = int (input("Введите номер задачи - "))
if a == 1:
    task1()
elif a == 2:
    task2()
elif a == 3:
    task3()
elif a == 4:
    task4()
else:
    print ("Такой задачи в 4й лабораторной нет")